Repository: shin1mk/MagnetStorm
Catalog: MagnetStorm/Localizable/*.lproj/Localizable.strings
Languages: ru, uk

# noStorm_description
source: No storm: Impact on the human body is practically absent. People do not feel any physical or emotional changes.
ru: Отсутствие бури: Влияние на организм человека практически отсутствует. Люди не ощущают никаких физических или эмоциональных изменений.
uk: Відсутність бурі: Вплив на організм людини практично відсутній. Люди не відчувають жодних фізичних чи емоційних змін.

# minorStorm_description
source: Minor storm: The impact on a person is very insignificant. People with increased sensitivity to magnetic fields may notice anxiety.
ru: Слабая буря: Влияние на человека очень незначительное. Люди с повышенной чувствительностью к магнитным полям могут замечать беспокойство.
uk: Слабка буря: Вплив на людину дуже незначний. Люди з підвищеною чутливістю до магнітних полів можуть відчувати легке занепокоєння.

# weakStorm_description
source: Weak storm: The impact on the human body is small. Sensitive individuals may experience headaches or changes in sleep.
ru: Умеренная буря: Влияние на организм человека небольшое. Чувствительные люди могут испытывать головные боли или изменения в сне.
uk: Помірна буря: Вплив на організм людини залишається невеликим. Деякі люди можуть відчувати головні болі або зміни у сні.

# moderateStorm_description
source: Moderate storm: The storm increases the likelihood of symptoms. Headaches, insomnia, and mood deterioration are possible.
ru: Сильная буря: Буря повышает вероятность появления симптомов. Возможны головные боли, бессонница, ухудшение настроения.
uk: Сильна буря: Буря підвищує ймовірність появи симптомів. Можливі головні болі, безсоння та погіршення настрою.

# strongStorm_description
source: Strong storm: The storm increases the likelihood of symptoms. Severe headaches, insomnia, and mood deterioration are possible.
ru: Очень сильная буря: Буря повышает вероятность появления симптомов. Возможны сильные головные боли, бессонница, ухудшение настроения.
uk: Дуже сильна буря: Буря підвищує ймовірність появи симптомів. Можливі сильні головні болі, безсоння та погіршення настрою.

# severeStorm_description
source: Severe storm: The impact on a person at this level is serious. Headaches and nervousness can intensify.
ru: Сильнейшая буря: Влияние на человека на этом уровне серьезные. Могут усилиться головная боль и нервозность.
uk: Найсильніша буря: Вплив на людину на цьому рівні серйозний. Можливе підсилення головного болю та нервозності.

# extremeStorm_description
source: Extreme-scale storm: More serious headaches, insomnia, and mood changes may occur.
ru: Буря выдающегося масштаба: Могут возникать более серьезные головные боли, бессонница и изменения настроения.
uk: Буря видатного масштабу: Можуть виникати більш серйозні головні болі, безсоння та зміни настрою.

# outstandingStorm_description
source: Outstanding-scale storm: The storm can cause significant deterioration in physical and emotional condition.
ru: Буря исключительного масштаба: Буря может вызвать значительное ухудшение физического и эмоционального состояния.
uk: Буря виняткового масштабу: Буря може викликати значуще погіршення фізичного та емоційного стану.

# exceptionalStorm_description
source: Exceptional storm: At this level, the most serious and uncertain effects on a person are possible.
ru: Сверхбуря: На этом уровне возможны самые серьезные и неопределенные воздействия на человека.
uk: Сверхбуря: На цьому рівні можливі найсерйозніші та невизначені впливи на людину.

# superStorm_description
source: Super storm: The highest level of magnetic storm activity, with catastrophic consequences for the entire human body and technical equipment in the world.
ru: Супербуря: Самый высший уровень активности магнитных бурь, с катастрофическими последствиями для всего организма и технического оборудования.
uk: Супербуря: Найвищий рівень активності магнітних бурь, із катастрофічними наслідками для всього організму та технічного обладнання.

# noInternet_description
source: No network
ru: Нет сети
uk: Немає інтернет з'єднання

# noStorm_info
source: Absence of Storm G0
ru: Отсутствие бури Kp-индекс 0
uk: Відсутність бурі Kp-індекс 0

# minorStorm_info
source: Minor Storm G1
ru: Слабая буря Kp-индекс 1
uk: Слабка буря Kp-індекс 1

# weakStorm_info
source: Weak Storm G2
ru: Умеренная буря Kp-индекс 2
uk: Помірна буря Kp-індекс 2

# moderateStorm_info
source: Moderate Storm G3
ru: Сильная буря Kp-индекс 3
uk: Сильна буря Kp-індекс 3

# strongStorm_info
source: Strong Storm G4
ru: Очень сильная буря Kp-индекс 4
uk: Дуже сильна буря Kp-індекс 4

# severeStorm_info
source: Severe Storm G5
ru: Сильнейшая буря Kp-индекс 5
uk: Найсильніша буря Kp-індекс 5

# extremeStorm_info
source: Extreme-Scale Storm G6
ru: Буря выдающегося масштаба Kp-индекс 6
uk: Буря видатного масштабу Kp-індекс 6

# outstandingStorm_info
source: Outstanding-Scale Storm G7
ru: Буря исключительного масштаба Kp-индекс 7
uk: Буря виняткового масштабу Kp-індекс 7

# exceptionalStorm_info
source: Exceptional Storm G8
ru: Сверхбуря Kp-индекс 8
uk: Сверхбуря Kp-індекс 8

# superStorm_info
source: Super Storm G9
ru: Супербуря Kp-индекс 9
uk: Супербуря Kp-індекс 9

# noStorm_description_info
source: At this level of geomagnetic activity, the human body is practically unaffected by magnetic storms. People do not feel any physical or emotional changes. Sleep is stable, mood remains consistently good, and physical condition remains normal.
ru: На этом уровне геомагнитной активности организм человека практически не подвергается влиянию магнитных бурь. Люди не ощущают никаких физических или эмоциональных изменений. Сон стабилен, настроение неизменно хорошее, и физическое состояние остается в норме.
uk: На цьому рівні геомагнітної активності організм людини практично не піддається впливу магнітних бурь. Люди не відчувають жодних фізичних чи емоціональних змін. Сон стабільний, настрій незмінно хороший, і фізичний стан залишається в нормі.

# minorStorm_description_info
source: At this level of geomagnetic activity, the impact on a person is very insignificant. Some people with increased sensitivity to magnetic fields may notice mild anxiety and nervousness. There may be slight changes in sleep and mood, but they usually do not interfere with normal life.
ru: На данном уровне геомагнитной активности воздействие на человека очень незначительное. Некоторые люди с повышенной чувствительностью к магнитным полям могут замечать легкое беспокойство и нервозность. Могут возникать легкие изменения в сне и настроении, но они обычно не мешают нормальной жизни.
uk: На даному рівні геомагнітної активності вплив на людину дуже незначний. Деякі люди з підвищеною чутливістю до магнітних полів можуть відчувати легке занепокоєння та нервозність. Можуть виникати легкі зміни у сні та настрої, але вони зазвичай не заважають нормальному життю.

# weakStorm_description_info
source: At this level of geomagnetic activity, the impact on the human body remains small. Some people may experience mild headaches or changes in sleep. Brief periods of anxiety and irritability may occur, but they usually pass quickly.
ru: На этом уровне геомагнитной активности воздействие на организм человека все равно остается небольшим. Некоторые люди могут испытывать легкие головные боли или изменения в сне. Могут возникать кратковременные периоды тревожности и раздражительности, но они обычно быстро проходят.
uk: На цьому рівні геомагнітної активності вплив на організм людини все одно залишається невеликим. Деякі люди можуть відчувати легкі головні болі або зміни у сні. Можуть виникати краткочасні періоди тривожності і роздратованості, але вони зазвичай швидко проходять.

# moderateStorm_description_info
source: At this level of geomagnetic activity, a storm can increase the likelihood of physical and emotional symptoms in most people. Moderate headaches, insomnia, and mild mood deterioration are possible. Brief episodes of anxiety and irritability may occur.
ru: На данном уровне геомагнитной активности буря может повысить вероятность появления физических и эмоциональных симптомов у большинства людей. Возможны умеренные головные боли, бессонница и легкое ухудшение настроения. Могут возникать кратковременные эпизоды тревожности и раздражительности.
uk: На даному рівні геомагнітної активності буря може підвищити ймовірність появи фізичних і емоціональних симптомів у більшості людей. Можливі помірні головні болі, безсоння і легке погіршення настрою. Можуть виникати краткочасні епізоди тривожності і роздратованості.

# strongStorm_description_info
source: At this level of geomagnetic activity, a storm significantly increases the likelihood of physical and emotional symptoms in most people. Severe headaches, insomnia, and noticeable mood deterioration are possible. Feelings of irritability and dissatisfaction may intensify.
ru: На данном уровне геомагнитной активности буря значительно повышает вероятность появления физических и эмоциональных симптомов у большинства людей. Возможны сильные головные боли, бессонница и заметное ухудшение настроения. Чувство раздражительности и недовольства может усилиться.
uk: На даному рівні геомагнітної активності буря значно підвищує ймовірність появи фізичних і емоціональних симптомів у більшості людей. Можливі сильні головні болі, безсоння і помітне погіршення настрою. Почуття роздратованості і незадоволеності може зростати.

# severeStorm_description_info
source: At this level of geomagnetic activity, the impact on a person may become more noticeable. Symptoms such as insomnia, severe headaches, and pronounced nervousness may intensify. Physical and emotional conditions may significantly worsen.
ru: На этом уровне геомагнитной активности воздействие на человека может стать более заметным. Могут усилиться симптомы, такие как бессонница, сильные головные боли и выраженная нервозность. Физическое и эмоциональное состояние могут значительно ухудшиться.
uk: На цьому рівні геомагнітної активності вплив на людину може стати більш помітним. Можуть зусилитися симптоми, такі як безсоння, сильні головні болі і виражена нервозність. Фізичний і емоційний стан може значно погіршитися.

# extremeStorm_description_info
source: At this level of geomagnetic activity, symptoms of geomagnetic activity may become more pronounced and widespread. More severe headaches, insomnia, and significant mood changes may occur. The level of anxiety and irritability increases.
ru: На данном уровне симптомы геомагнитной активности могут стать более выраженными и распространенными. Могут возникать более сильные головные боли, бессонница и значительные изменения настроения. Уровень тревожности и раздражительности повышается.
uk: На даному рівні симптоми геомагнітної активності можуть стати більш виразними і поширеними. Можуть виникати сильні головні болі, безсоння і значні зміни настрою. Рівень тривожності і роздратованості підвищується.

# outstandingStorm_description_info
source: At this level of geomagnetic activity, a storm can cause significant deterioration in physical and emotional condition. Headaches, insomnia, nervousness, and pronounced mood deterioration may be observed to a significant extent.
ru: На данном уровне геомагнитной активности буря может вызвать значительное ухудшение физического и эмоционального состояния. Головные боли, бессонница, нервозность и выраженное ухудшение настроения могут наблюдаться в значительной степени.
uk: На даному рівні геомагнітної активності буря може викликати значуще погіршення фізичного і емоціонального стану. Головні болі, безсоння, нервозність і виражене погіршення настрою можуть спостерігатися в значній мірі.

# exceptionalStorm_description_info
source: At this level of geomagnetic activity, the most serious and uncertain effects on a person are possible. Severe headaches, insomnia, and significant changes in emotional state may occur. Anxiety and irritability reach their peak.
ru: На этом уровне геомагнитной активности возможны самые серьезные и неопределенные воздействия на человека. Могут возникать сильные головные боли, бессонницы и значительное изменение эмоционального состояния. Тревожность и раздражительность достигают пика.
uk: На цьому рівні геомагнітної активності можливі найсерйозніші і невизначені впливи на людину. Можуть виникати сильні головні болі, безсоння та значне змінення емоційного стану. Тривожність і роздратованість досягають піку.

# superStorm_description_info
source: The highest level of magnetic storm activity, with catastrophic consequences for the entire human body and technical equipment in the world. At this level, the human body may experience the most serious physical and emotional symptoms, including severe headaches, insomnia, and extremely high anxiety. Emotional state can be extremely unstable and uncertain.
ru: Самый высший уровень активности магнитных бурь, с катастрофическими последствиями для всего организма и технического оборудования в мире. На этом уровне организм человека может испытывать самые серьезные физические и эмоциональные симптомы, включая сильные головные боли, бессонницу и крайне высокую тревожность. Эмоциональное состояние может быть крайне нестабильным и неопределенным.
uk: Найвищий рівень активності магнітних бурь, із катастрофічними наслідками для всього організму та технічного обладнання в світі. На цьому рівні організм людини може відчувати найсерйозніші фізичні і емоціональні симптоми, включаючи сильні головні болі, безсоння та надзвичайну тривожність. Емоційний стан може бути надзвичайно нестабільним і невизначеним.

# noInternet_description_info
source: No internet connection. Please check your internet connection and try again.
ru: Отсутствует подключение к интернету. Пожалуйста, проверьте свое интернет-соединение и повторите попытку.
uk: Відсутнє підключення до інтернету. Будь ласка, перевірте ваше інтернет-з'єднання і повторіть спробу.

# notification_text
source: New data on geomagnetic activity.
ru: Новые данные о геомагнитной активности.
uk: Нові дані про геомагнітну активність.

# rateApp_text
source: Rate App
uk: Оцініть додаток

# forecast3days_text
source: 3 days forecast
ru: Прогноз на 3 дня
uk: Прогноз на 3 дні

# chartToday_text
source: Today
ru: Сегодня
uk: Сьогодні

# chartTomorrow_text
source: Tomorrow
ru: Завтра
uk: Завтра

# chartAfterday_text
source: Afterday
ru: Послезавтра
uk: Післязавтра

# titleAurora_text
source: Aurora Borealis
ru: Cеверное Cияние
uk: Північне Cяйво

# descriptionAurora_text
source: NORTHERN HEMISPHERE
ru: Северное полушарие
uk: Північна півкуля

# geomagneticTitle
source: Geomagnetic Activity
ru: Геомагнитная активность
uk: Геомагнітна активність

# geomagneticDescription_text
source: If the geomagnetic field is active (as indicated by the G index), the northern lights (aurora) will be visible further from the poles. Geomagnetic activity depends on solar activity and the presence of solar coronal holes, so it varies over time. The level of geomagnetic activity is measured using the planetary G index, and the intensity of the aurora is expressed in gigawatts (GW). The G index ranges from 0 to 9, and the intensity of the aurora varies from lower values to higher ones. It should be noted that there are moments when these relationships do not hold exactly.
ru: Если геомагнитное поле активно (по индексу Кр), то северное сияние (аурора) будет наблюдаться дальше от полюсов. Геомагнитная активность зависит от солнечной активности и наличия солнечных корональных дыр, поэтому она изменяется со временем. Уровень геомагнитной активности измеряется с использованием планетарного индекса Кр, а интенсивность сияния выражается в гигаваттах (ГВт). Индекс Кр варьируется от 0 до 9, а интенсивность ауроры - от более низких значений к более высоким. Следует отметить, что бывают моменты когда эти отношения не отображаются в точности.
uk: Якщо геомагнітне поле активне (за Kp-індексом), то північне сяйво (аврора) буде спостерігатися далеко від полюсів. Геомагнітна активність залежить від сонячної активності та наявності сонячних корональних дір, тому вона змінюється з часом. Рівень геомагнітної активності вимірюється за допомогою планетарного Kp-індекса, а інтенсивність сяйва виражається в гігаватах (ГВт). Kp-індекс варіюється від 0 до 9, а інтенсивність аврори - від менших значень до більших. Важливо зауважити, що бувають миті, коли ці залежності не відображаються точно.

# locationTitle
source: Location
ru: Местоположение
uk: Місце розташування

# locationDescription_text
source: For the best northern lights viewing, head towards the magnetic poles. With the right choice of location, such as on top of a hill in the northern hemisphere with an unobstructed view to the north, you can see the aurora even when it is still 1000 km to the north. It is important to note that if you are beneath the aurora in the right place, you can enjoy beautiful auroral displays even during low geomagnetic activity (G = 2 or 3).
ru: Для наилучшего наблюдения северного сияния двигайтесь в направлении магнитных полюсов. При правильном выборе местоположения, например, на вершине холма на северном полушарии с неограниченным видом на север, вы можете видеть аурору даже тогда, когда она находится еще на 1000 км к северу. Важно отметить, что если вы находитесь под ауророй в правильном месте, то сможете насладиться красивыми ауроральными явлениями даже при низкой геомагнитной активности (Кр = 2 или 3).
uk: Для найкращого спостереження північного сяйва рухайтесь в напрямку магнітних полюсів. При правильному виборі місця, наприклад, на вершині пагорба на північному півкулі з необмеженим видом на північ, ви можете побачити аврору навіть тоді, коли вона знаходиться ще на 1000 км на північ. Важливо відзначити, що якщо ви знаходитесь під авророю в правильному місці, ви зможете насолодитися красивими авроральними явищами навіть при низькій геомагнітній активності (Kp-індекс = 2 або 3).

# mustBeDarkTitle
source: It Must Be Dark
ru: Должно быть темно
uk: Повинно бути темно

# mustBeDarkDescription_text
source: For optimal northern lights observation, venture out during the night. Move away from artificial city lights. The light of a full moon may reduce the apparent brightness of the aurora, but not its actual brightness.
ru: Для наилучшего наблюдения северного сияния выбирайтесь на наблюдения в ночное время. Удалитесь от источников искусственного света городов. Свет полной луны может снизить видимую яркость ауроры, но не фактическую яркость.
uk: Для найкращого спостереження північного сяйва вирушайте на спостереження в нічний час. Видаліться від джерел штучного світла міст. Світло повнолуня може зменшити видиму яскравість аврори, але не фактичну яскравість.

# timeTitle
source: Timing
ru: Время
uk: Час

# timeDescription_text
source: The best time for northern lights observation usually falls within an hour or two around midnight. These hours of auroral activity expand towards the evening and morning as the level of geomagnetic activity increases. Although the aurora may be visible in the evening and morning, it is usually less active and, therefore, less visually appealing. The most favorable seasons for northern lights observation are around the spring and fall equinoxes.
ru: Наилучшее время для наблюдения северного сияния обычно приходится на час-два около полуночи. Эти часы активности ауроры расширяются к вечеру и утру с увеличением уровня геомагнитной активности. Хотя аурора может быть видима и вечером и утром, она обычно менее активна и, следовательно, менее визуально привлекательна. Самые благоприятные сезоны для наблюдения северного сияния приходятся на весеннее и осеннее равноденствие.
uk: Найкращий час для спостереження північного сяйва зазвичай припадає на годину-дві близько півночі. Ці години активності аврори розширюються ввечері та зранку зі збільшенням рівня геомагнітної активності. Хоча аврора може бути видимою і ввечері і вранці, вона зазвичай менш активна і, отже, менше візуально приваблива. Самі сприятливі сезони для спостереження північного сяйва припадають на весняне і осіннє рівноденствя.
